In [1]:
import pandas as pd

# Question 1

In [2]:
tbl1 = r"DSInternDataSet.xlsx"
df1 = pd.read_excel(tbl1, sheet_name = "Sheet3", skiprows = 0)
df1.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at,unit_price
0,1,53,746,224,2,cash,2017-03-13 12:36:56.190,112
1,2,92,925,90,1,cash,2017-03-03 17:38:51.999,90
2,3,44,861,144,1,cash,2017-03-14 04:23:55.595,144
3,4,18,935,156,1,credit_card,2017-03-26 12:43:36.649,156
4,5,18,883,156,1,credit_card,2017-03-01 04:35:10.773,156

## Initial AOV evaluation

1a. The current average order value (AOV) finds the average amount spent on each order without considering the number of shoes in each order. 
There is a high order_amount value (704,000) in the dataset which skews the AOV higher, compared to other values. This value is not considered an outlier because it appears accurate relative to the number of sneakers ordered.

1b. The metric I would report for this dataset would be the weighted average to properly consider the number of sneakers purchased in each order.

#### 1c. Calculating the Weighted Average

In [3]:
total_order_amount = df1['order_amount'].sum()
total_shoes_ordered = df1['total_items'].sum()
weighted_average = total_order_amount/total_shoes_ordered

In [4]:
print ("Total order amount =", total_order_amount)
print("Total number of sneakers ordered =", total_shoes_ordered)
print("Weighted Average =", round(weighted_average))

Total order amount = 15725640
Total number of sneakers ordered = 43936
Weighted Average = 358.0

NOTES: Due to the relatively small size of the data, I checked for blank cells using Excel.

# QUESTION 2

### 2a. How many orders were shipped by Speedy Express in total?
### ANSWER: 54

#### SQL QUERY:

In [ ]:
SELECT
Count (DISTINCT OrderID)
FROM Orders
WHERE ShipperID=1

NOTES: The distinct function is called to handle any orderID duplicates that might be in the data.

### 2b. What is the last name of the employee with the most orders?
### ANSWER: Peacock

#### SQL QUERY:

In [ ]:
SELECT lastname, MAX (ordercount) FROM 
    (
        SELECT o.employeeid, lastname, count(orderid) ordercount
         FROM orders o
            JOIN employees em ON o.employeeid = em.employeeid
        GROUP BY o.employeeid
    )

### 2c. What product was ordered the most by customers in Germany?
### ANSWER: Gorgonzola Telino

#### SQL QUERY:

In [ ]:
SELECT productid, productname, MAX(ProductCount) FROM 
    (
          SELECT o.orderid, c.customerid, orderdetailid, od.productid, count(od.productid) ProductCount
          FROM Orders o
          JOIN customers c on o.customerid = c.customerid
          JOIN orderdetails od on o.orderid = od.orderid
          WHERE country = 'Germany'
          GROUP BY productid
     )
JOIN products USING (productid)